app/Models/ClientesModel.php

    public function listarClientes(){
        $this->builder->select('*');
        $this->builder->orderBy('ID_Cliente','desc');
        $query=$this->builder->get(); //traemos los datos de la tabla rol y lo almacenamos en la var. query
---
SELECT *
FROM `cliente`
ORDER BY `ID_Cliente` DESC

     public function getClientes($id)
     {
         $this->builder->select('*');
         $this->builder->where('ID_Cliente', $id);
         $query = $this->builder->get(); //traemos los datos de la tabla clientes y lo almacenamos en la var. query
---
SELECT *
FROM `cliente`
WHERE `ID_Cliente` = '4'